# Hanukkah of Data: Day 01

## Setup

In [1]:
import pandas as pd

from hanukkah_of_data.utils import load_data, string_to_phone_number

## Load data

In [2]:
dfs = load_data()

In [3]:
customers_df = dfs["customers"]

## Solve puzzle

In [4]:
customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11080 entries, 0 to 11079
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customerid    11080 non-null  int64
 1   name          11080 non-null  string
 2   address       11080 non-null  string
 3   citystatezip  11080 non-null  string
 4   birthdate     11080 non-null  datetime64[ns]
 5   phone         11080 non-null  string
dtypes: datetime64[ns](1), int64(1), string(4)
memory usage: 519.5 KB

In [5]:
customers_df.head()

,customerid,name,address,citystatezip,birthdate,phone
0,1001,Jack Quinn,201 E Park St,"Los Angeles, CA 91343",1960-05-14,805-287-8515
1,1002,David Powell,224C Tysens Ln,"Staten Island, NY 10306",1978-04-04,516-768-1652
2,1003,Carrie Green,1608 W 53rd Way,"Tampa, FL 33614",1969-01-21,727-209-0470
3,1004,Steven Miller,178½ E 7th St,"Manhattan, NY 10009",1953-08-17,607-941-9563
4,1005,Christine Powers,270 W 242nd St,"Bronx, NY 10463",1983-06-06,212-759-9043

In [6]:
customers_df[["first_name", "last_name"]] = customers_df.name.str.split(
    " ", n=1, expand=True
)

Potential candidates are those customers, whose last names consist of exactly 10 chars

In [7]:
candidates_df = customers_df.loc[
    customers_df.last_name.str.len() == 10, ["name", "first_name", "last_name", "phone"]
]

In [8]:
candidates_df.head()

                     name first_name   last_name         phone
39       Grant Warner III      Grant  Warner III  631-874-1040
65   Stephanie Fitzgerald  Stephanie  Fitzgerald  631-259-0721
73       Derek Mclaughlin      Derek  Mclaughlin  716-582-2269
93        Kara Mccullough       Kara  Mccullough  716-251-2601
109      Keith Gamble III      Keith  Gamble III  909-657-3312

In [9]:
candidates_df.last_name = (
    candidates_df.last_name.str.replace(" ", "").str.replace(".", "").str.lower()
)

/tmp/ipykernel_23675/3919721992.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  candidates_df.last_name.str.replace(" ", "").str.replace(".", "").str.lower()

In [99]:
candidates_df.head()

                     name first_name   last_name         phone
39       Grant Warner III      Grant   warneriii  631-874-1040
65   Stephanie Fitzgerald  Stephanie  fitzgerald  631-259-0721
73       Derek Mclaughlin      Derek  mclaughlin  716-582-2269
93        Kara Mccullough       Kara  mccullough  716-251-2601
109      Keith Gamble III      Keith   gambleiii  909-657-3312

In [105]:
candidates_df["last_name_phone"] = candidates_df.last_name.apply(string_to_phone_number)

In [108]:
candidates_df.head()

                     name first_name   last_name         phone last_name_phone
39       Grant Warner III      Grant   warneriii  631-874-1040       927637444
65   Stephanie Fitzgerald  Stephanie  fitzgerald  631-259-0721      3489437253
73       Derek Mclaughlin      Derek  mclaughlin  716-582-2269      6252844546
93        Kara Mccullough       Kara  mccullough  716-251-2601      6228556844
109      Keith Gamble III      Keith   gambleiii  909-657-3312       426253444

In [107]:
candidates_df.loc[
    candidates_df.phone.str.replace("-", "") == candidates_df.last_name_phone,
    ["name", "phone"],
]

                name         phone
2187  Sam Guttenberg  488-836-2374